ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_pass.c
/******************************************************************************
* Function Name: Cy_BLE_PASSC_NotificationEventHandler
***************************************************************************//**
*
*  Handles the Notification Event.
*
*  \param eventParam:  The pointer to a data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_PASSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_PASS_ApplCallback != NULL))
    {
        cy_stc_ble_pass_char_value_t locCharValue =
        {
            .connHandle = eventParam->connHandle,
            .value      = &eventParam->handleValPair.value
        };

        for(locCharValue.charIndex = CY_BLE_PASS_AS; locCharValue.charIndex < CY_BLE_PASS_CP; locCharValue.charIndex++)
        {
            if(cy_ble_passc[discIdx].charInfo[locCharValue.charIndex].valueHandle == eventParam->handleValPair.attrHandle)
            {
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                break;
            }
        }

        if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) == 0u)
        {
            Cy_BLE_PASS_ApplCallback((uint32_t)CY_BLE_EVT_PASSC_NOTIFICATION, &locCharValue);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_PASSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles the Read Response Event.
*
*  \param eventParam:  The pointer to the data structure.
*
******************************************************************************/
static void Cy_BLE_PASSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_PASS_ApplCallback != NULL) &&
       (cy_ble_passcReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        cy_en_ble_pass_char_index_t locCharIndex;

        for(locCharIndex = CY_BLE_PASS_AS; locCharIndex < CY_BLE_PASS_CP; locCharIndex++)
        {
            if(cy_ble_passc[discIdx].charInfo[locCharIndex].valueHandle == cy_ble_passcReqHandle[discIdx])
            {
                cy_stc_ble_pass_char_value_t locCharValue =
                {
                    .connHandle = eventParam->connHandle,
                    .charIndex  = locCharIndex,
                    .value      = &eventParam->value
                };
                cy_ble_passcReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_PASS_ApplCallback((uint32_t)CY_BLE_EVT_PASSC_READ_CHAR_RESPONSE, &locCharValue);
            }
            else if(cy_ble_passc[discIdx].charInfo[locCharIndex].descrHandle[CY_BLE_PASS_CCCD] ==
                    cy_ble_passcReqHandle[discIdx])
            {
                cy_stc_ble_pass_descr_value_t locDescrValue =
                {
                    .connHandle = eventParam->connHandle,
                    .charIndex  = locCharIndex,
                    .descrIndex = CY_BLE_PASS_CCCD,
                    .value      = &eventParam->value
                };

                cy_ble_passcReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_PASS_ApplCallback((uint32_t)CY_BLE_EVT_PASSC_READ_DESCR_RESPONSE, &locDescrValue);
            }
            else
            {
            }

            if(cy_ble_passcReqHandle[discIdx] == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
            {
                break;
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_PASSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles the Write Response Event.
*
*  \param eventParam:  The pointer to a data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_PASSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_PASS_ApplCallback != NULL) &&
       (cy_ble_passcReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        cy_en_ble_pass_char_index_t locCharIndex;

        for(locCharIndex = CY_BLE_PASS_AS; locCharIndex < CY_BLE_PASS_CP; locCharIndex++)
        {
            if(cy_ble_passc[discIdx].charInfo[locCharIndex].descrHandle[CY_BLE_PASS_CCCD] ==
               cy_ble_passcReqHandle[discIdx])
            {
                cy_stc_ble_pass_descr_value_t locDescValue =
                {
                    .connHandle = *eventParam,
                    .charIndex  = locCharIndex,
                    .descrIndex = CY_BLE_PASS_CCCD,
                    .value      = NULL
                };
                cy_ble_passcReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_PASS_ApplCallback((uint32_t)CY_BLE_EVT_PASSC_WRITE_DESCR_RESPONSE, &locDescValue);
                break;
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_PASSC_ErrorResponseEventHandler
***************************************************************************//**
*
*  Handles the Error Response Event.
*
*  \param eventParam:  Pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_PASSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam)
{
    if(eventParam != NULL)
    {
        uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);
        if(eventParam->errInfo.attrHandle == cy_ble_passcReqHandle[discIdx])
        {
            cy_ble_passcReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }
}


#endif /* CY_BLE_PASS_CLIENT */

